ТОИР_демо/src/InformationRegisters/торо_ВыходныеДокументы/торо_ВыходныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыходныеДокументы</name>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыходнойДокумент</name>
    <type>
      <types>EnumRef.торо_ВидыВыходныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Documents/торо_СостоянияОбъектовРемонта/торо_СостоянияОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_СостоянияОбъектовРемонта</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_ТекущееСостояниеОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_КоличествоПусковОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяНахожденияВСостоянии</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОборудованиеНаИспытаниях</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийОтклоненияВРаботеОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаПростоя</name>
      <type>
        <types>CatalogRef.торо_ПричиныПростояОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменятьСостояниеПодчиненныхОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатации</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПуска</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатацииНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПускаНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/Documents/торо_УчетКонтролируемыхПоказателей/торо_УчетКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УчетКонтролируемыхПоказателей</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееЗначение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроля</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КритическийМаксимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимыйМаксимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимыйМинимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>КритическийМинимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/Catalogs/торо_ТиповыеДефектыОборудования/торо_ТиповыеДефектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеДефектыОборудования</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.торо_НаправленияОбъектовРемонтныхРабот</owners>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДефекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныВозникновенияДефекта</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/CommonForms/торо_ФормаПодбораОРПриВводеНаОсновании/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗакрыватьПриВыборе = Константы.торо_ИспользоватьУпрощеннуюФормуДефекта.Получить();
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
	ФОИспользоватьУпрощеннуюФормуДефекта = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУпрощеннуюФормуДефекта");
	
	ДокументОснование = Параметры.ДокОснование;
	Если ТипЗнч(Параметры.ДокОснование) = Тип("ДокументСсылка.торо_СостоянияОбъектовРемонта") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	таб.ОбъектРемонта КАК ОР,
		               |	таб.ОбъектРемонта.ПодразделениеИсполнитель КАК Исполнитель
		               |ИЗ
		               |	Документ.торо_СостоянияОбъектовРемонта.ОбъектыРемонта КАК таб
		               |ГДЕ
		               |	таб.Ссылка = &Ссылка";
					   
		запрос.УстановитьПараметр("Ссылка", Параметры.ДокОснование);
		выборка = Запрос.Выполнить().Выгрузить();
		СписокОР.Загрузить(выборка);
		
	ИначеЕсли ТипЗнч(Параметры.ДокОснование) = Тип("ДокументСсылка.торо_УчетКонтролируемыхПоказателей") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ДокТЧ.ОбъектРемонта КАК ОР,
		               |	ДокТЧ.ОбъектРемонта.ПодразделениеИсполнитель КАК Исполнитель
		               |ИЗ
		               |	Документ.торо_УчетКонтролируемыхПоказателей.Показатели КАК ДокТЧ
		               |ГДЕ
		               |	ДокТЧ.Ссылка = &Ссылка";
					   
		запрос.УстановитьПараметр("Ссылка", Параметры.ДокОснование);
		выборка = Запрос.Выполнить().Выгрузить();
		СписокОР.Загрузить(выборка);
		
	ИначеЕсли ТипЗнч(Параметры.ДокОснование) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		Запрос = Новый Запрос;
		Запрос.текст = "ВЫБРАТЬ
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ВидРемонтныхРабот КАК ВидРемонтныхРабот
		               |ПОМЕСТИТЬ ДокТЧ
		               |ИЗ
		               |	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
		               |ГДЕ
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка = &Ссылка
		               |
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ВыходныеДокументы.СписокОбъектов КАК СписокОбъектов
		               |ПОМЕСТИТЬ рсВыходныеДокументы
		               |ИЗ
		               |	РегистрСведений.торо_ВыходныеДокументы КАК торо_ВыходныеДокументы
		               |ГДЕ
		               |	торо_ВыходныеДокументы.ВыходнойДокумент = &ВыходнойДокумент
		               |	И (торо_ВыходныеДокументы.СписокОбъектов, торо_ВыходныеДокументы.ВидМероприятия) В
		               |			(ВЫБРАТЬ
		               |				Таб.ОбъектРемонта,
		               |				Таб.ВидРемонтныхРабот
		               |			ИЗ
		               |				ДокТЧ КАК Таб)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	СписокОбъектов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОР,
					      |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.ПодразделениеИсполнитель КАК Исполнитель
		               |ИЗ
		               |	рсВыходныеДокументы КАК рсВыходныеДокументы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		               |		ПО рсВыходныеДокументы.СписокОбъектов = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов";
					   
		Запрос.УстановитьПараметр("Ссылка", Параметры.ДокОснование);
		Запрос.УстановитьПараметр("ВыходнойДокумент", Параметры.ТипВыходногоДок);
		 
		выборка = Запрос.Выполнить().Выгрузить();
		СписокОР.Загрузить(выборка);
	ИначеЕсли ТипЗнч(Параметры.ДокОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбследованноеОборудование.ОбъектРемонта КАК ОР,
		               |	ОбследованноеОборудование.ID,
		               |	ОбследованноеОборудование.ТиповойДефект,
		               |	ОбследованноеОборудование.Исполнитель,
		               |	торо_ТиповыеДефектыОборудования.ВидДефекта,
		               |	торо_ТиповыеДефектыОборудования.КритичностьДефекта,
		               |	торо_ТиповыеДефектыОборудования.ОписаниеДефекта КАК ДефектОписание,
		               |	ОбследованноеОборудование.Ссылка КАК ДефектВыявленВПроцессе,
		               |	торо_ТиповыеДефектыОборудования.ПричиныВозникновенияДефекта.(
		               |		Причина КАК ДефектПричина
		               |	) КАК ПричиныВозникновенияДефекта
		               |ИЗ
		               |	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК ОбследованноеОборудование
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеДефектыОборудования КАК торо_ТиповыеДефектыОборудования
		               |		ПО ОбследованноеОборудование.ТиповойДефект = торо_ТиповыеДефектыОборудования.Ссылка
		               |ГДЕ
		               |	ОбследованноеОборудование.Ссылка = &Ссылка";
					   
		запрос.УстановитьПараметр("Ссылка", Параметры.ДокОснование);
		выборка = Запрос.Выполнить().Выгрузить();
		
		Для каждого текСтрока из Выборка цикл
			нс = СписокОр.Добавить();
			ЗаполнитьЗначенияСвойств(нс, текСтрока);
			
			Причины = текСтрока.ПричиныВозникновенияДефекта;
			Если Причины.Количество() >= 1 Тогда
				нс.ДефектПричина = Причины[0].ДефектПричина;
			КонецЕсли;
		КонецЦикла;
					   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокОРКоличество = СписокОР.Количество();
	Если СписокОРКоличество = 0 Тогда
		Закрыть();
	ИначеЕсли СписокОРКоличество = 1 Тогда
		СписокОР[0].Флажок = Истина;
		ПеренестиВДокумент(1);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОРВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текСтрока = СписокОР.НайтиПоИдентификатору(ВыбраннаяСтрока);
	масОР = Новый Массив();
	МасОр.Добавить(текСтрока);
	ПередатьВДокумент(масОР);
КонецПроцедуры

&НаКлиенте
Процедура СписокОРФлажокПриИзменении(Элемент)
	
	МассовыйВыбор = НЕ ФОИспользоватьУпрощеннуюФормуДефекта;
	
	Если НЕ МассовыйВыбор Тогда
		Если Элементы.СписокОР.ТекущиеДанные.Флажок = Истина Тогда
			Для каждого текСтрока из СписокОР Цикл
				ТекСтрока.Флажок = Ложь;
			КонецЦикла;
			Элементы.СписокОР.ТекущиеДанные.Флажок = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКоманд

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	масОР = СписокОР.НайтиСтроки(Новый Структура("Флажок", Истина));
	ПередатьВДокумент(масОР);
КонецПроцедуры

#КонецОбласти
 
#Область ОбщегоНазначения

&НаКлиенте 
Процедура ПередатьВДокумент(МасОР)
	МасВозврата = ПреобразоватьДанныеДляВозвращения(МасОР);
	
	стрВозврата = новый структура;
	стрВозврата.Вставить("Описание", "НовоеЗаполнение");
	стрВозврата.Вставить("ДокОснование", ДокументОснование);
	стрВозврата.Вставить("Данные", МасВозврата);
	
	ОповеститьОВыборе(стрВозврата);
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьДанныеДляВозвращения(МасОР)
	
	МасВозврата = Новый Массив;
	Для каждого текЭлем из МасОР Цикл
		стрВозврата = Новый Структура("ОбъектРемонта, ID, ПодразделениеИсполнитель, ТиповойДефект, ВидДефекта, КритичностьДефекта, 
				|ДефектВыявленВПроцессе, ДефектОписание, ДефектПричина");
		ЗаполнитьЗначенияСвойств(стрВозврата, текЭлем);
		стрВозврата.ОбъектРемонта = текЭлем.Ор;
		стрВозврата.ID = текЭлем.ID;
		стрВозврата.ПодразделениеИсполнитель = текЭлем.Исполнитель;
		МасВозврата.Добавить(стрВозврата);
	КонецЦикла;
	
	возврат МасВозврата;
	
КонецФункции 

#КонецОбласти
